CRUD stands for Create, Read, Update and Delete. These are the four fundamental operations we'll use when working with data in Pandas. Whether we're creating a DataFrame from scratch, analyzing existing data, modifying values or saving our results these operations are important in Pandas.

Let’s see each operation step by step to see how they make data manipulation easy.

### 1. Create: Creating Dataframe
Creating a dataset in Pandas means building a DataFrame which is the main data structure in Pandas. We can create a DataFrame using various methods like reading from a file or directly creating one from Python objects like dictionaries, lists or arrays

#### 1. Creating a DataFrame from a Dictationary

This is one of the easiest and most commonly used methods to create a dataset in Pandas

In [1]:
import pandas as pd
data = {
    "Name": ["Ansh", "Sahil", "Ram"],
    "Age": [21, 20, 41],
    "City": ["Moradabad", "New Delhi", "Chennai"]
}
df = pd.DataFrame(data)
print(df)

    Name  Age       City
0   Ansh   21  Moradabad
1  Sahil   20  New Delhi
2    Ram   41    Chennai

#### 2. Creating a DataFrame from Lists

We can also create a DataFrame by combining lists.

In [4]:
names = ["Akshit", "Uday", "Sam"]
ages = [25, 30, 35]
cities = ["Gurugram", "New Delhi", "Chicago"]

df = pd.DataFrame({
    "Name": names,
    "Age": ages,
    "City": cities
})

df

     Name  Age       City
0  Akshit   25   Gurugram
1    Uday   30  New Delhi
2     Sam   35    Chicago

#### 3. Creating a DataFrame from a CSV File

We can also create a DataFrame by reading an external file like a CSV. Here we used the random car.csv data.

In [26]:
df=pd.read_csv("CAR.csv")
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

### 2. Read: Reading Dataframe
Now that we’ve created a dataset using the Create operation, lets see by using the Read operation. This step is all about accessing and understanding our data. Pandas provides simple methods to view our dataset, check its structure and analyze its contents.

#### 1. Viewing Rows in a DataFrame

head(n): Displaying the First Few Rows
tail(n): Displaying the Last Few Rows

In [28]:
data = {"Name": ["Eve", "Jack", "Charlie", "Henry", "John"],
        "Age": [25, 30, 35, 40, 45],
        "City": ["NY", "LA", "SF", "Houston", "Seattle"]}
df = pd.DataFrame(data)

print(df.head(3))

print()

print(df.tail(2))

      Name  Age City
0      Eve   25   NY
1     Jack   30   LA
2  Charlie   35   SF

    Name  Age     City
3  Henry   40  Houston
4   John   45  Seattle

#### 2. Exploring Columns of the dataset

In [7]:
print(df.columns)

Index(['Name', 'Age', 'City'], dtype='object')

#### 3. Checking Data Types with dtype

We use df.types to check the particular data type of the columns we have for further operations

In [8]:
print(df.dtypes)

Name    object
Age      int64
City    object
dtype: object

#### 4. Generating Descriptive Statistics with describe()

This is a very important command used in pandas to check the overall statistics for the numerical data so that we can make predictions and move easily in our data exploration.

In [9]:
print(df.describe())

             Age
count   5.000000
mean   35.000000
std     7.905694
min    25.000000
25%    30.000000
50%    35.000000
75%    40.000000
max    45.000000

#### 3. Filtering Columns

Accessing a single Column.

In [11]:
print(df["Name"])

0        Eve
1       Jack
2    Charlie
3      Henry
4       John
Name: Name, dtype: object

#### 4. Accessing Multiple columns

In [12]:
print(df[["Name", "City"]])

      Name     City
0      Eve       NY
1     Jack       LA
2  Charlie       SF
3    Henry  Houston
4     John  Seattle

#### 5. Finding Unique Values in a Column

Finding unique tends to provide the non-duplicates values in our columns.

In [13]:
print(df["City"].unique())

['NY' 'LA' 'SF' 'Houston' 'Seattle']

#### 6. Filtering Rows (Conditional Filtering)

Single Condition Filtering.

In [15]:
print(df[df["Age"] > 30])

      Name  Age     City
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

#### 7. Filtering with Multiple Conditions (AND/OR Logic)

In [16]:
print(df[(df["Age"] > 30) & (df["City"] == "SF")])

print(df[(df["Age"] > 30) | (df["City"] == "LA")])

      Name  Age City
2  Charlie   35   SF
      Name  Age     City
1     Jack   30       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

#### 8. Indexing in Pandas

Integer-Based Indexing with iloc.

In [18]:
print(df.iloc[0])

Name    Eve
Age      25
City     NY
Name: 0, dtype: object

#### 9. Accessing Rows and Cells

In [17]:
print(df.iloc[0, 2])

NY

#### 10. Slicing Rows

In [19]:
print(df.iloc[1:3])

      Name  Age City
1     Jack   30   LA
2  Charlie   35   SF

#### 11. Label-Based Indexing

In [29]:
df.set_index("Name", inplace=True)

#### 12. Setting an Index and Accessing Rows by Labels

In [31]:
print(df.loc["Eve"])

Age     25
City    NY
Name: Eve, dtype: object

### 3. Update: Modifying Data in Pandas
Update operation allows us to modify existing data within a DataFrame. Whether we're changing specific values, updating entire columns or applying conditions to update data, Pandas makes it simple.

We will use the following dataset for the update operations.

In [32]:
data = {'Name': ['Eve', 'Jack', 'Charlie', 'Henry', 'John'],
        'Age': [25, 30, 35, 40, 45],
        'City': ['NY', 'LA', 'SF', 'Houston', 'Seattle']}
df = pd.DataFrame(data)
df

      Name  Age     City
0      Eve   25       NY
1     Jack   30       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

#### 1. Updating a Single Value: We can update a single value in a specific row and column using loc or iloc.

In [33]:
df.loc[df['Name'] == 'Jack', 'Age'] = 42

print(df)

      Name  Age     City
0      Eve   25       NY
1     Jack   42       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

#### 2. Updating an Entire Column: We can update an entire column by assigning a new list, series or value.

In [34]:
df['City'] = ['Boston', 'Chicago', 'LA', 'Austin', 'Miami']
df

      Name  Age     City
0      Eve   25   Boston
1     Jack   42  Chicago
2  Charlie   35       LA
3    Henry   40   Austin
4     John   45    Miami

#### 3. Updating Based on a Condition: We can apply conditions to update values in a DataFrame

In [35]:
df.loc[df['City'] == 'LA', 'Age'] = 31
df

      Name  Age     City
0      Eve   25   Boston
1     Jack   42  Chicago
2  Charlie   31       LA
3    Henry   40   Austin
4     John   45    Miami

### 4. Delete: Removing Data in Pandas
Delete operation allows us to remove data from a DataFrame. We can drop rows, columns or specific values providing flexibility in cleaning and manipulating datasets. For the delete operations we will use the dataset below.

In [36]:
data = {'Name': ['Eve', 'Jack', 'Charlie', 'Henry', 'John'],
        'Age': [25, 30, 35, 40, 45],
        'City': ['NY', 'LA', 'SF', 'Houston', 'Seattle']}
df = pd.DataFrame(data)

print(df)

      Name  Age     City
0      Eve   25       NY
1     Jack   30       LA
2  Charlie   35       SF
3    Henry   40  Houston
4     John   45  Seattle

#### 1. Delete a Column: We can delete a column using the drop() method.

In [37]:
df = df.drop('City', axis=1)
print(df)

      Name  Age
0      Eve   25
1     Jack   30
2  Charlie   35
3    Henry   40
4     John   45

#### 2. Delete a Row: Similarly we can delete rows by specifying the index.

In [38]:
df = df.drop(2, axis=0) 
print(df)

    Name  Age
0    Eve   25
1   Jack   30
3  Henry   40
4   John   45

#### 3. Delete Rows Based on Condition: We can delete rows based on conditions.

In [39]:
df = df[df['Age'] != 35]
print(df)

    Name  Age
0    Eve   25
1   Jack   30
3  Henry   40
4   John   45

#### 4. Delete entire dataset: To delete the entire DataFrame, we can use the del statement or reassign it to an empty DataFrame.

In [40]:
df = pd.DataFrame(data)

del df